---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.SizeNotAvailableInFabricationService
source: html/0ce3f62c-1522-9894-552c-71ce45a5cbc1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.SizeNotAvailableInFabricationService Property

Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.

## Syntax (C#)
```csharp
public static FailureDefinitionId SizeNotAvailableInFabricationService { get; }
```